{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"inputs": {"embedding_input": {"name": "embedding_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "35"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30000"}, {"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "35"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/NotEqual", "op": "NotEqual", "input": ["embedding_input", "StatefulPartitionedCall/sequential/embedding/NotEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/embedding/Cast", "op": "Cast", "input": ["embedding_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_94"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_95"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_96"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential/embedding/NotEqual", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential/embedding/Cast", "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_87"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_93"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_92"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/zeros", "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_91"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_90"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_89"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/MatMul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_27/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_49", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/add", "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_27/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/split/split_dim", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_19_switch/_67", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_20_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_56:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_73", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Sigmoid", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_92", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_64:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_94", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_66:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_93", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor_switch/_65:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read_1/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_95", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_19_switch/_67:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_61:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_19_switch/_67:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_96", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_20_switch/_68:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/input/_115", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_58:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_91", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_63:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_73", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/mul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_64:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/input/_115", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read_1/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor_switch/_65:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/input/_115", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read_1/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/input/_115", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_56:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_66:1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add_3", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Sigmoid_2", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/MatMul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/add", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_20_switch/_68:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_1/Relu", "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/zeros_like"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split/split_dim", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_2/Relu", "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_88"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_3/BiasAdd", "^StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/zeros_like_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_62:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_28/while/mul_1", "op": "Mul", "input": 